#include "stdafx.h"
#include "stringtable.h"
#define	__VER 15

#if __VER <= 7
#define	MAX_LANG	6
#elif __VER == 8
#define	MAX_LANG	8
#elif __VER >= 9 && __VER < 12
#define	MAX_LANG	9
#elif __VER >= 12
#define	MAX_LANG	13
#elif __VER >= 15
#define	MAX_LANG	13
#endif

#define	MAX_SERVER_APP	7
#if	__VER >= 15
	#define	MAX_STRING_ID_CLIENT	11
#else
	#define	MAX_STRING_ID_CLIENT	10
#endif

#if	__VER >= 15
	#define	MAX_STRING_ID_SERVER	4
#elif __VER >= 12
	#define	MAX_STRING_ID_SERVER	3
#else 
	#define	MAX_STRING_ID_SERVER	2
#endif 

#define	eng	0
#define	php	1
#define	jap	2
#define	tha	3
#define	twn	4
#define	ger	5
#define	chl	6
#define	fre	7
#define	hk	8
#define	por	9
#define vtn	10
#define	rus	11
#define	ind	12


int main(const int argc, char* argv[])
{
	char apszNeuz[MAX_LANG][MAX_STRING_ID_CLIENT+1][MAX_PATH]	=
	{
#if __VER == 6
			"\\\\jnora\\pub\\6th\\eng\\Neuz.exe", "64.147.162.103",	"1",	"1",	"1",	"1", "19731110", "15400", "60000", "5", "1252",
			"\\\\jnora\\pub\\6th\\php\\Neuz.exe", "125.5.127.17",	"1",	"2",	"0",	"0", "20070326", "15400", "60000", "5", "1252",
			"\\\\jnora\\pub\\6th\\jap\\Neuz.exe", "210.136.104.31",	"2",	"0",	"1",	"0", "20060629", "15400", "0", "0", "932",
			"\\\\jnora\\pub\\6th\\tha\\Neuz.exe", "203.195.98.81",	"4",	"0",	"0",	"0", "20060629", "15400", "0", "0", "874",
			"\\\\jnora\\pub\\6th\\twn\\Neuz.exe", "203.69.140.24",	"5",	"0",	"0",	"0", "20061215", "15400", "0", "0", "950",
			"\\\\jnora\\pub\\6th\\ger\\Neuz.exe", "195.27.0.101",	"6",	"0",	"1",	"0", "20060629", "15400", "60000", "5", "1252"
#elif __VER == 7
			"\\\\jnora\\pub\\7th\\eng\\Neuz.exe", "64.147.162.103",	"1",	"1",	"1",	"1", "20070712", "15400", "60000", "5", "1252",
			"\\\\jnora\\pub\\7th\\php\\Neuz.exe", "125.5.127.17",	"1",	"2",	"0",	"0", "20070712", "15400", "60000", "5", "1252",
			"\\\\jnora\\pub\\7th\\jap\\Neuz.exe", "210.136.104.31",	"2",	"0",	"1",	"0", "20070712", "15400", "0", "0", "932",
			"\\\\jnora\\pub\\7th\\tha\\Neuz.exe", "203.195.98.81",	"4",	"0",	"0",	"0", "20070712", "15400", "0", "0", "874",
			"\\\\jnora\\pub\\7th\\twn\\Neuz.exe", "203.69.140.24",	"5",	"0",	"0",	"0", "20070712", "15400", "0", "0", "950",
			"\\\\jnora\\pub\\7th\\ger\\Neuz.exe", "195.27.0.101",	"6",	"0",	"1",	"0", "20070712", "15400", "60000", "5", "1252"
#elif __VER == 8
			"\\\\jnora\\pub\\8th\\eng\\Neuz.exe", "64.147.162.103",	"1",	"1",	"1",	"1", "20070712", "15400", "60000", "5", "1252",
			"\\\\jnora\\pub\\8th\\php\\Neuz.exe", "125.5.127.17",	"1",	"2",	"0",	"1", "20070712", "15400", "60000", "5", "1252",
			"\\\\jnora\\pub\\8th\\jap\\Neuz.exe", "210.136.104.31",	"2",	"0",	"1",	"1", "20070712", "15400", "0", "0", "932",
			"\\\\jnora\\pub\\8th\\tha\\Neuz.exe", "203.195.98.81",	"4",	"0",	"0",	"1", "20070712", "15400", "0", "0", "874",
			"\\\\jnora\\pub\\8th\\twn\\Neuz.exe", "203.69.140.24",	"5",	"0",	"0",	"1", "20070712", "15400", "0", "0", "950",
			"\\\\jnora\\pub\\8th\\ger\\Neuz.exe", "195.27.0.101",	"6",	"0",	"1",	"1", "20070712", "15400", "60000", "5", "1252",
			"\\\\jnora\\pub\\8th\\chl\\Neuz.exe", "204.2.134.20",	"7",	"0",	"0",	"1", "20070712", "15400", "60000", "5", "1252",
			"\\\\jnora\\pub\\8th\\fre\\Neuz.exe", "195.27.0.93",	"8",	"0",	"1",	"1", "20070712", "15400", "60000", "5", "1252"
#elif __VER == 9
			"\\\\jnora\\pub\\9th\\eng\\Neuz.exe", "64.147.162.103",	"1",	"1",	"1",	"1", "20070712", "15400", "60000", "5", "1252",
			"\\\\jnora\\pub\\9th\\php\\Neuz.exe", "125.5.127.17",	"1",	"2",	"0",	"1", "20070712", "15400", "60000", "5", "1252",
			"\\\\jnora\\pub\\9th\\jap\\Neuz.exe", "210.136.104.31",	"2",	"0",	"1",	"0", "20070712", "15400", "0", "0", "932",
			"\\\\jnora\\pub\\9th\\tha\\Neuz.exe", "203.195.98.81",	"4",	"0",	"0",	"1", "20070712", "15400", "0", "0", "874",
			"\\\\jnora\\pub\\9th\\twn\\Neuz.exe", "203.69.140.24",	"5",	"0",	"0",	"0", "20070712", "15400", "0", "0", "950",
			"\\\\jnora\\pub\\9th\\ger\\Neuz.exe", "195.59.138.10",	"6",	"0",	"1",	"1", "20070712", "15400", "60000", "5", "1252",
			"\\\\jnora\\pub\\9th\\chl\\Neuz.exe", "204.2.134.20",	"7",	"0",	"0",	"1", "20070712", "15400", "60000", "5", "1252",
			"\\\\jnora\\pub\\9th\\fre\\Neuz.exe", "195.59.138.5",	"8",	"0",	"1",	"1", "20070712", "15400", "60000", "5", "1252",
			"\\\\jnora\\pub\\9th\\hk\\Neuz.exe", "203.174.49.231",	"9",	"0",	"1",	"1", "20070712", "15400", "0", "0", "950"
#elif __VER == 11
			"\\\\jnora\\pub\\11th\\eng\\Neuz.exe", "64.147.162.103",	"1",	"1",	"1",	"1", "20070712", "15400", "60000", "5", "1252",
			"\\\\jnora\\pub\\11th\\php\\Neuz.exe", "125.5.127.17",	"1",	"2",	"0",	"1", "20070712", "15400", "60000", "5", "1252",
			"\\\\jnora\\pub\\11th\\jap\\Neuz.exe", "210.136.104.31",	"2",	"0",	"1",	"0", "20070712", "15400", "60000", "3", "932",
			"\\\\jnora\\pub\\11th\\tha\\Neuz.exe", "203.195.98.81",	"4",	"0",	"0",	"1", "20070712", "15400", "0", "0", "874",
			"\\\\jnora\\pub\\11th\\twn\\Neuz.exe", "203.69.140.24",	"5",	"0",	"0",	"0", "20070712", "15400", "0", "0", "950",
			"\\\\jnora\\pub\\11th\\ger\\Neuz.exe", "195.59.138.10",	"6",	"0",	"1",	"1", "20070712", "15400", "60000", "5", "1252",
			"\\\\jnora\\pub\\11th\\chl\\Neuz.exe", "204.2.134.20",	"7",	"0",	"0",	"1", "20070712", "15400", "60000", "5", "1252",
			"\\\\jnora\\pub\\11th\\fre\\Neuz.exe", "195.59.138.5",	"8",	"0",	"1",	"1", "20070712", "15400", "60000", "5", "1252",
			"\\\\jnora\\pub\\11th\\hk\\Neuz.exe", "203.174.49.231",	"9",	"0",	"1",	"1", "20070712", "15400", "60000", "5", "950",
#elif __VER == 12
			"\\\\jnora\\pub\\12th\\eng\\Neuz.exe", "38.99.82.207",	"1",	"1",	"1",	"1", "20070712", "15400", "60000", "5", "1252",
			"\\\\jnora\\pub\\12th\\php\\Neuz.exe", "125.5.127.17",	"1",	"2",	"0",	"1", "20070712", "15400", "60000", "5", "1252",
			"\\\\jnora\\pub\\12th\\jap\\Neuz.exe", "210.148.99.31",	"2",	"0",	"1",	"0", "20070712", "15400", "60000", "3", "932",
			"\\\\jnora\\pub\\12th\\tha\\Neuz.exe", "203.195.98.81",	"4",	"0",	"0",	"1", "20070712", "15400", "0", "0", "874",
			"\\\\jnora\\pub\\12th\\twn\\Neuz.exe", "203.69.140.24",	"5",	"0",	"0",	"0", "20070712", "15400", "0", "0", "950",
			"\\\\jnora\\pub\\12th\\ger\\Neuz.exe", "195.59.138.10",	"6",	"0",	"1",	"1", "20070712", "15400", "60000", "5", "1252",
			"\\\\jnora\\pub\\12th\\chl\\Neuz.exe", "204.2.134.20",	"7",	"0",	"0",	"1", "20070712", "15400", "60000", "5", "1252",
			"\\\\jnora\\pub\\12th\\fre\\Neuz.exe", "195.59.138.5",	"8",	"0",	"1",	"1", "20070712", "15400", "60000", "5", "1252",
			"\\\\jnora\\pub\\12th\\hk\\Neuz.exe", "203.174.49.231",	"9",	"0",	"1",	"1", "20070712", "15400", "60000", "5", "950",
			"\\\\jnora\\pub\\12th\\por\\Neuz.exe", "38.99.82.191",	"10",	"0",	"1",	"1", "20070712", "15400", "60000", "5", "1252",
			"\\\\jnora\\pub\\12th\\vtn\\Neuz.exe", "203.89.140.12",	"11",	"0",	"1",	"1", "20070712", "15400", "60000", "5", "1258"
#elif __VER == 13
			"\\\\engbuild\\d$\\해외프로그램\\13th\\eng\\Neuz.exe", "38.99.82.207",	"1",	"1",	"1",	"1", "20070712", "15400", "60000", "5", "1252",
			"\\\\engbuild\\d$\\해외프로그램\\13th\\php\\Neuz.exe", "125.5.127.17",	"1",	"2",	"0",	"1", "20070712", "15400", "60000", "5", "1252",
			"\\\\engbuild\\d$\\해외프로그램\\13th\\jap\\Neuz.exe", "210.148.99.31",	"2",	"0",	"1",	"0", "20070712", "15400", "60000", "3", "932",
			"\\\\engbuild\\d$\\해외프로그램\\13th\\tha\\Neuz.exe", "203.195.98.81",	"4",	"0",	"0",	"1", "20070712", "15400", "0", "0", "874",
			"\\\\engbuild\\d$\\해외프로그램\\13th\\twn\\Neuz.exe", "60.199.180.13",	"5",	"0",	"0",	"0", "20070712", "15400", "0", "0", "950",
			"\\\\engbuild\\d$\\해외프로그램\\13th\\ger\\Neuz.exe", "195.59.138.10",	"6",	"0",	"1",	"1", "20070712", "15400", "60000", "5", "1252",
			"\\\\engbuild\\d$\\해외프로그램\\13th\\chl\\Neuz.exe", "204.2.134.20",	"7",	"0",	"0",	"1", "20070712", "15400", "60000", "5", "1252",
			"\\\\engbuild\\d$\\해외프로그램\\13th\\fre\\Neuz.exe", "195.59.138.5",	"8",	"0",	"1",	"1", "20070712", "15400", "60000", "5", "1252",
			"\\\\engbuild\\d$\\해외프로그램\\13th\\hk\\Neuz.exe", "61.238.149.76",	"9",	"0",	"1",	"1", "20070712", "15400", "60000", "5", "950",
			"\\\\engbuild\\d$\\해외프로그램\\13th\\por\\Neuz.exe", "38.99.82.191",	"10",	"0",	"1",	"1", "20070712", "15400", "60000", "5", "1252",
			"\\\\engbuild\\d$\\해외프로그램\\13th\\vtn\\Neuz.exe", "203.89.140.12",	"11",	"0",	"1",	"1", "20070712", "15400", "60000", "5", "1258"
#elif __VER == 14
			"\\\\engbuild\\d$\\해외프로그램\\14th\\eng\\Neuz.exe", "204.2.134.207",	"1",	"1",	"1",	"1", "20070712", "15400", "60000", "5", "1252",
			"\\\\engbuild\\d$\\해외프로그램\\14th\\php\\Neuz.exe", "125.5.127.17",	"1",	"2",	"0",	"1", "20070712", "15400", "60000", "5", "1252",
			"\\\\engbuild\\d$\\해외프로그램\\14th\\jap\\Neuz.exe", "210.148.99.31",	"2",	"0",	"1",	"0", "20070712", "15400", "60000", "3", "932",
			"\\\\engbuild\\d$\\해외프로그램\\14th\\tha\\Neuz.exe", "203.195.98.81",	"4",	"0",	"0",	"1", "20070712", "15400", "0", "0", "874",
			"\\\\engbuild\\d$\\해외프로그램\\14th\\twn\\Neuz.exe", "60.199.180.13",	"5",	"0",	"0",	"0", "20070712", "15400", "0", "0", "950",
			"\\\\engbuild\\d$\\해외프로그램\\14th\\ger\\Neuz.exe", "195.59.138.10",	"6",	"0",	"1",	"1", "20070712", "15400", "60000", "5", "1252",
			"\\\\engbuild\\d$\\해외프로그램\\14th\\chl\\Neuz.exe", "204.2.134.20",	"7",	"0",	"1",	"1", "20070712", "15400", "60000", "5", "1252",
			"\\\\engbuild\\d$\\해외프로그램\\14th\\fre\\Neuz.exe", "195.59.138.5",	"8",	"0",	"1",	"1", "20070712", "15400", "60000", "5", "1252",
			"\\\\engbuild\\d$\\해외프로그램\\14th\\hk\\Neuz.exe", "203.174.49.238",	"9",	"0",	"1",	"1", "20070712", "15400", "60000", "5", "950",
			"\\\\engbuild\\d$\\해외프로그램\\14th\\por\\Neuz.exe", "187.17.74.134",	"10",	"0",	"1",	"1", "20070712", "15400", "60000", "5", "1252",
			"\\\\engbuild\\d$\\해외프로그램\\14th\\vtn\\Neuz.exe", "203.89.140.12",	"11",	"0",	"1",	"1", "20070712", "15400", "60000", "5", "1258",
			"\\\\engbuild\\d$\\해외프로그램\\14th\\rus\\Neuz.exe", "188.93.59.99",	"12",	"0",	"1",	"1", "20070712", "15400", "60000", "5", "1251",
			"\\\\engbuild\\d$\\해외프로그램\\14th\\ind\\Neuz.exe", "220.226.181.109",	"1",	"3",	"1",	"1", "20070712", "15400", "60000", "5", "1252",
#elif __VER == 15
			"D:\\Work\\해외\\history\\프로그램\\15th\\eng\\Neuz.exe", "204.2.134.207",	"1",	"1",	"1",	"1", "20070712", "15400", "60000", "5", "1252", "0",
			"D:\\Work\\해외\\history\\프로그램\\15th\\php\\Neuz.exe", "125.5.127.17",	"1",	"2",	"0",	"1", "20070712", "15400", "60000", "5", "1252", "0",
			"D:\\Work\\해외\\history\\프로그램\\15th\\jap\\Neuz.exe", "203.216.218.75",	"2",	"0",	"1",	"0", "20070712", "15400", "60000", "3", "932", "1",
			"D:\\Work\\해외\\history\\프로그램\\15th\\tha\\Neuz.exe", "203.195.98.81",	"4",	"0",	"0",	"1", "20070712", "15400", "0", "0", "874", "0",
			"D:\\Work\\해외\\history\\프로그램\\15th\\twn\\Neuz.exe", "60.199.180.13",	"5",	"0",	"0",	"0", "20070712", "15400", "0", "0", "950", "0",
			"D:\\Work\\해외\\history\\프로그램\\15th\\ger\\Neuz.exe", "195.59.138.10",	"6",	"0",	"1",	"1", "20070712", "15400", "60000", "5", "1252", "0",
			"D:\\Work\\해외\\history\\프로그램\\15th\\chl\\Neuz.exe", "204.2.134.20",	"7",	"0",	"1",	"1", "20070712", "15400", "60000", "5", "1252", "0",
			"D:\\Work\\해외\\history\\프로그램\\15th\\fre\\Neuz.exe", "195.59.138.5",	"8",	"0",	"1",	"1", "20070712", "15400", "60000", "5", "1252", "0",
			"D:\\Work\\해외\\history\\프로그램\\15th\\hk\\Neuz.exe", "203.174.49.238",	"9",	"0",	"1",	"1", "20070712", "15400", "60000", "5", "950", "0",
			"D:\\Work\\해외\\history\\프로그램\\15th\\por\\Neuz.exe", "187.17.74.134",	"10",	"0",	"1",	"1", "20070712", "15400", "60000", "5", "1252", "0",
			"D:\\Work\\해외\\history\\프로그램\\15th\\vtn\\Neuz.exe", "203.89.140.12",	"11",	"0",	"1",	"1", "20070712", "15400", "60000", "5", "1258", "0",
			"D:\\Work\\해외\\history\\프로그램\\15th\\rus\\Neuz.exe", "188.93.59.99",	"12",	"0",	"1",	"1", "20070712", "15400", "60000", "5", "1251", "0",
			"D:\\Work\\해외\\history\\프로그램\\15th\\ind\\Neuz.exe", "202.59.255.21",	"1",	"3",	"0",	"1", "20070712", "15400", "60000", "5", "1252", "0",
#endif	
	};
	
	char apszServer[MAX_LANG][MAX_STRING_ID_SERVER+1][MAX_PATH]	=
	{
#if __VER == 6
			"\\\\jnora\\pub\\6th\\eng\\",	"1",	"1",
			"\\\\jnora\\pub\\6th\\php\\",	"1",	"2",
			"\\\\jnora\\pub\\6th\\jap\\",	"2",	"0",
			"\\\\jnora\\pub\\6th\\tha\\",	"4",	"0",
			"\\\\jnora\\pub\\6th\\twn\\",	"5",	"0",
			"\\\\jnora\\pub\\6th\\ger\\",	"6",	"0"	
#elif __VER == 7
			"\\\\jnora\\pub\\7th\\eng\\",	"1",	"1",
			"\\\\jnora\\pub\\7th\\php\\",	"1",	"2",
			"\\\\jnora\\pub\\7th\\jap\\",	"2",	"0",
			"\\\\jnora\\pub\\7th\\tha\\",	"4",	"0",
			"\\\\jnora\\pub\\7th\\twn\\",	"5",	"0",
			"\\\\jnora\\pub\\7th\\ger\\",	"6",	"0"	
#elif __VER == 8
			"\\\\jnora\\pub\\8th\\eng\\",	"1",	"1",
			"\\\\jnora\\pub\\8th\\php\\",	"1",	"2",
			"\\\\jnora\\pub\\8th\\jap\\",	"2",	"0",
			"\\\\jnora\\pub\\8th\\tha\\",	"4",	"0",
			"\\\\jnora\\pub\\8th\\twn\\",	"5",	"0",
			"\\\\jnora\\pub\\8th\\ger\\",	"6",	"0",
			"\\\\jnora\\pub\\8th\\chl\\",	"7",	"0",
			"\\\\jnora\\pub\\8th\\fre\\",	"8",	"0"	
#elif __VER == 9
			"\\\\jnora\\pub\\9th\\eng\\",	"1",	"1",
			"\\\\jnora\\pub\\9th\\php\\",	"1",	"2",
			"\\\\jnora\\pub\\9th\\jap\\",	"2",	"0",
			"\\\\jnora\\pub\\9th\\tha\\",	"4",	"0",
			"\\\\jnora\\pub\\9th\\twn\\",	"5",	"0",
			"\\\\jnora\\pub\\9th\\ger\\",	"6",	"0",
			"\\\\jnora\\pub\\9th\\chl\\",	"7",	"0",
			"\\\\jnora\\pub\\9th\\fre\\",	"8",	"0",
			"\\\\jnora\\pub\\9th\\hk\\",	"9",	"0"
#elif __VER == 11
			"\\\\jnora\\pub\\11th\\eng\\",	"1",	"1",
			"\\\\jnora\\pub\\11th\\php\\",	"1",	"2",
			"\\\\jnora\\pub\\11th\\jap\\",	"2",	"0",
			"\\\\jnora\\pub\\11th\\tha\\",	"4",	"0",
			"\\\\jnora\\pub\\11th\\twn\\",	"5",	"0",
			"\\\\jnora\\pub\\11th\\ger\\",	"6",	"0",
			"\\\\jnora\\pub\\11th\\chl\\",	"7",	"0",
			"\\\\jnora\\pub\\11th\\fre\\",	"8",	"0",
			"\\\\jnora\\pub\\11th\\hk\\",	"9",	"0"
#elif __VER == 12
			"\\\\jnora\\pub\\12th\\eng\\",	"1",	"1",	"0",
			"\\\\jnora\\pub\\12th\\php\\",	"1",	"2",	"0",
			"\\\\jnora\\pub\\12th\\jap\\",	"2",	"0",	"0",
			"\\\\jnora\\pub\\12th\\tha\\",	"4",	"0",	"0",
			"\\\\jnora\\pub\\12th\\twn\\",	"5",	"0",	"0",
			"\\\\jnora\\pub\\12th\\ger\\",	"6",	"0",	"0",
			"\\\\jnora\\pub\\12th\\chl\\",	"7",	"0",	"0",
			"\\\\jnora\\pub\\12th\\fre\\",	"8",	"0",	"0",
			"\\\\jnora\\pub\\12th\\hk\\",	"9",	"0",	"0",
			"\\\\jnora\\pub\\12th\\por\\",	"10",	"0",	"0",
			"\\\\jnora\\pub\\12th\\vtn\\",	"11",	"0",	"1258"
#elif __VER == 13
			"\\\\engbuild\\d$\\해외프로그램\\13th\\eng\\",	"1",	"1",	"0",
			"\\\\engbuild\\d$\\해외프로그램\\13th\\php\\",	"1",	"2",	"0",
			"\\\\engbuild\\d$\\해외프로그램\\13th\\jap\\",	"2",	"0",	"0",
			"\\\\engbuild\\d$\\해외프로그램\\13th\\tha\\",	"4",	"0",	"0",
			"\\\\engbuild\\d$\\해외프로그램\\13th\\twn\\",	"5",	"0",	"0",
			"\\\\engbuild\\d$\\해외프로그램\\13th\\ger\\",	"6",	"0",	"0",
			"\\\\engbuild\\d$\\해외프로그램\\13th\\chl\\",	"7",	"0",	"0",
			"\\\\engbuild\\d$\\해외프로그램\\13th\\fre\\",	"8",	"0",	"0",
			"\\\\engbuild\\d$\\해외프로그램\\13th\\hk\\",	"9",	"0",	"0",
			"\\\\engbuild\\d$\\해외프로그램\\13th\\por\\",	"10",	"0",	"0",
			"\\\\engbuild\\d$\\해외프로그램\\13th\\vtn\\",	"11",	"0",	"1258"
#elif __VER == 14
			"\\\\engbuild\\d$\\해외프로그램\\14th\\eng\\",	"1",	"1",	"0",
			"\\\\engbuild\\d$\\해외프로그램\\14th\\php\\",	"1",	"2",	"0",
			"\\\\engbuild\\d$\\해외프로그램\\14th\\jap\\",	"2",	"0",	"0",
			"\\\\engbuild\\d$\\해외프로그램\\14th\\tha\\",	"4",	"0",	"0",
			"\\\\engbuild\\d$\\해외프로그램\\14th\\twn\\",	"5",	"0",	"0",
			"\\\\engbuild\\d$\\해외프로그램\\14th\\ger\\",	"6",	"0",	"0",
			"\\\\engbuild\\d$\\해외프로그램\\14th\\chl\\",	"7",	"0",	"0",
			"\\\\engbuild\\d$\\해외프로그램\\14th\\fre\\",	"8",	"0",	"0",
			"\\\\engbuild\\d$\\해외프로그램\\14th\\hk\\",	"9",	"0",	"0",
			"\\\\engbuild\\d$\\해외프로그램\\14th\\por\\",	"10",	"0",	"0",
			"\\\\engbuild\\d$\\해외프로그램\\14th\\vtn\\",	"11",	"0",	"1258",
			"\\\\engbuild\\d$\\해외프로그램\\14th\\rus\\",	"12",	"0",	"0",
			"\\\\engbuild\\d$\\해외프로그램\\14th\\ind\\",	"1",	"3",	"0",

#elif __VER == 15
			"D:\\Work\\해외\\history\\프로그램\\15th\\eng\\",	"1",	"1",	"0",		"0",
			"D:\\Work\\해외\\history\\프로그램\\15th\\php\\",	"1",	"2",	"0",		"0",
			"D:\\Work\\해외\\history\\프로그램\\15th\\jap\\",	"2",	"0",	"0",		"1",
			"D:\\Work\\해외\\history\\프로그램\\15th\\tha\\",	"4",	"0",	"0",		"0",
			"D:\\Work\\해외\\history\\프로그램\\15th\\twn\\",	"5",	"0",	"0",		"0",
			"D:\\Work\\해외\\history\\프로그램\\15th\\ger\\",	"6",	"0",	"0",		"0",
			"D:\\Work\\해외\\history\\프로그램\\15th\\chl\\",	"7",	"0",	"0",		"0",
			"D:\\Work\\해외\\history\\프로그램\\15th\\fre\\",	"8",	"0",	"0",		"0",
			"D:\\Work\\해외\\history\\프로그램\\15th\\hk\\",	"9",	"0",	"0",		"0",
			"D:\\Work\\해외\\history\\프로그램\\15th\\por\\",	"10",	"0",	"0",		"0",
			"D:\\Work\\해외\\history\\프로그램\\15th\\vtn\\",	"11",	"0",	"1258",		"0",
			"D:\\Work\\해외\\history\\프로그램\\15th\\rus\\",	"12",	"0",	"0",		"0",
			"D:\\Work\\해외\\history\\프로그램\\15th\\ind\\",	"1",	"3",	"0",		"0",
#endif
	};
	char	apszFile[MAX_SERVER_APP][MAX_PATH]	=
	{	
			"program\\AccountServer.exe",
			"program\\CacheServer.exe",
			"program\\Certifier.exe",
			"program\\CoreServer.exe",
			"program\\LoginServer.exe",
			"resource\\DatabaseServer.exe",
			"resource\\WorldServer.exe"
	};


	if( argc == 2 )
	{
	}
	else
	{
		CStringTable	st;
		for (auto& i : apszNeuz)
		{
			BOOL bResult = st.GetStringBlock(i[0], MAKELANGID(LANG_KOREAN, SUBLANG_KOREAN) );
			for( int j = 1; j <= MAX_STRING_ID_CLIENT; j++ )
				bResult	&= st.SetString( j, i[j] );

			bResult	&= st.UpdateStringBlock(i[0], MAKELANGID(LANG_KOREAN, SUBLANG_KOREAN) );
			printf( "%s - %s\n", i[0], bResult? "ok": "error" );
		}
		
		for (auto& i : apszServer)
		{
			for (auto& k : apszFile)
			{
				char sApp[MAX_PATH]	= { 0,};
				sprintf( sApp, "%s%s", i[0], k);
				BOOL bResult	= st.GetStringBlock( sApp, MAKELANGID(LANG_ENGLISH, SUBLANG_ENGLISH_US) );
				for( int j = 1; j <= MAX_STRING_ID_SERVER; j++ )
					bResult	&= st.SetString( j + 1, i[j] );

				bResult	&= st.UpdateStringBlock( sApp, MAKELANGID(LANG_ENGLISH, SUBLANG_ENGLISH_US) );
				printf( "%s - %s\n", sApp, bResult? "ok": "error" );
			}
		}
	}
	return 0;
}

