----------------------------------------------------------------------
---- 이벤트 드랍 관련 루아 함수 로딩 --------------------------------------
----------------------------------------------------------------------
dofile(".\\LuaFunc\\EventDropFunc.lua")



----------------------------------------------------------------------------------------------------------------
----  1. AddEvent( szDesc )				-- 이벤트 추가 및 설명 등록
----  2. SetLang( KANG_KOR, LANG_JAP, .... )		-- 국가 설정
----  3. SetTime( szStartTime, szEndTime )		-- 해당 이벤트의 시작 시간, 종료 시간 등록(여러개 설정 가능)
----						   ( 시간 형식 -- "2007-05-03 17:53" )
----  4. SetMonsterLevel( dwLevelMin, dwLevelMax )		-- 몬스터 레벨 구간 설정
----  5. SetItem( szItemId, dwprop, dwNumPerOneDay )	-- 이벤트용 드롭 아이템, 드롭확률(10000 = 100%), 드롭 갯수(하루당),
----------------------------------------------------------------------------------------------------------------
--[[ SAMPLE
AddEventDrop( "EVENT TEST 01" )
--{
	SetLang( LANG_KOR )
	SetLang( LANG_JAP )
	
	SetTime( "2007-06-08 14:23", "2007-06-08 16:11" )
	SetTime( "2007-06-09 14:23", "2007-06-10 00:00" )

	SetLevel( 1, 15 )
	
	SetItem( "II_SYS_SYS_EVE_HAPPYMONEY01", 3000, 15 )
	SetItem( "II_SYS_SYS_EVE_PUMPKIN01", 2000, 16 )
--}
--]]

-------------------------------------------------------------------------
---- Begin Script -------------------------------------------------------
-------------------------------------------------------------------------

AddEventDrop( "National Education's Day" )
--{
	SetLang( "LANG_ID" )

	SetTime( "2012-05-02 00:01", "2012-05-05 23:59" )

	SetLevel( 15, 152 )

	SetItem( "II_SYS_SYS_SCR_BXFSUPER0107", 2000, 48 )
	SetItem( "II_SYS_SYS_SCR_BXMSUPER0107", 1500, 48 )
--}

-----------------